Revit 2027 API
DataTransferProgressChangedEventArgs.TransferMode Property
 Data transfer mode in this event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DataTransferMode TransferMode { get; }
Public ReadOnly Property TransferMode As DataTransferMode
	Get
public:
property DataTransferMode TransferMode {
	DataTransferMode get ();
}
member TransferMode : DataTransferMode with get
Property Value
DataTransferMode
See Also
Reference
DataTransferProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace